# Executed Event (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AddInCommandBinding..::..Executed Event
AddInCommandBinding Class See Also
---
Occurs when the command associated with this AddInCommandBinding executes.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public event EventHandler<ExecutedEventArgs> Executed
```

Visual Basic
---
```text
Public Event Executed As EventHandler(Of ExecutedEventArgs)
```

Visual C++
---
```text
public:
 event EventHandler<ExecutedEventArgs^>^ Executed {
	void add (EventHandler<ExecutedEventArgs^>^ value);
	void remove (EventHandler<ExecutedEventArgs^>^ value);
}
```

# See Also
AddInCommandBinding Class
Autodesk.Revit.UI Namespace